" ====================================================================================================
" 基本設定
" ====================================================================================================
"文字コードをUFT-8に設定
set fenc=utf-8
" 入力中のコマンドをステータスに表示する
set showcmd
" １００文字区切りの印
set colorcolumn=100
" 履歴保存数
set history=1000
" カラー表示をON
syntax on
" 改行表示をON
set list
" <C-a>,C-x>押下時のインクリメント、デクリメント計算を１０進数基準とする。
" 007に対して<C-a>叩いた時に、010になるのを防ぐ
set nrformats=



" ====================================================================================================
" キーバインド設定
" ====================================================================================================
" ----------------------------------------------------------------------------------------------------
" 所定のキー押下にESCに割り当て
" ----------------------------------------------------------------------------------------------------
inoremap <silent> jj <ESC>
" ----------------------------------------------------------------------------------------------------
" 日本語入力で”っj”と入力してもEnterキーで確定させればインサートモードを抜ける
" ----------------------------------------------------------------------------------------------------
inoremap <silent> っｊ <ESC>

" ----------------------------------------------------------------------------------------------------
" 指定文字で囲む
" ----------------------------------------------------------------------------------------------------
xnoremap s' c''<Esc>P
xnoremap s" c""<Esc>P
xnoremap s( c()<Esc>P
xnoremap s) c()<Esc>P
xnoremap s[ c[]<Esc>P
xnoremap s] c[]<Esc>P
xnoremap s{ c{}<Esc>P
xnoremap s} c{}<Esc>P
xnoremap s< c<><Esc>P
xnoremap s> c<><Esc>P

" ----------------------------------------------------------------------------------------------------
" ノーマルモードでのカーソル移動
" ----------------------------------------------------------------------------------------------------
nnoremap <C-j> <C-f>
nnoremap <C-k> <C-b>
nnoremap <C-h> ^
nnoremap <C-l> g_

nnoremap vrc  :vsp    ~/.vimrc<CR>
nnoremap svrc :source ~/.vimrc<CR>


" ----------------------------------------------------------------------------------------------------
" 入力モードでのカーソル移動
" ----------------------------------------------------------------------------------------------------
" inoremap <C-j> <C-f>
" inoremap <C-k> <C-b>
inoremap <C-h> ^
inoremap <C-l> g_
" inoremap <C-j> <Down>
" inoremap <C-k> <Up>
" inoremap <C-h> <Left>
" inoremap <C-l> <Right>
" inoremap <C-ｊ> <Down>
" inoremap <C-ｋ> <Up>
" inoremap <C-ｈ> <Left>
" inoremap <C-ｌ> <Right>
inoremap ・ <ESC>/

" ----------------------------------------------------------------------------------------------------
" ビジュアルモードでのカーソル移動
" ----------------------------------------------------------------------------------------------------
" xnoremap <C-j> <C-f>
" xnoremap <C-k> <C-b>
" xnoremap <C-h> ^
" xnoremap <C-l> g_

" ----------------------------------------------------------------------------------------------------
" 日本語入力がオンのままでも使えるコマンド(Enterキーは必要)
" ----------------------------------------------------------------------------------------------------
nnoremap あ a
nnoremap い i
nnoremap う u
nnoremap お o
nnoremap っｄ dd
nnoremap っｙ yy
nnoremap ｐ p

nnoremap ｈ h
nnoremap ｊ j
nnoremap ｋ k
nnoremap ｌ l

" ----------------------------------------------------------------------------------------------------
" 移動キーをずらす
" ----------------------------------------------------------------------------------------------------
" nnoremap j h
" nnoremap k j
" nnoremap l k
" nnoremap ; l

" ----------------------------------------------------------------------------------------------------
" 折り返し時に表示行単位での移動できるようにする
" ----------------------------------------------------------------------------------------------------
" nnoremap j gj
" nnoremap k gk

" ----------------------------------------------------------------------------------------------------
" 文字、行の削除はレジスタに入れない
" ----------------------------------------------------------------------------------------------------
" nnoremap c "_c
" nnoremap d "_d
" nnoremap x "_x
" xnoremap c "_c
" xnoremap d "_d
" xnoremap x "_x

" ----------------------------------------------------------------------------------------------------
" スペース挿入時用の枠入力
" ----------------------------------------------------------------------------------------------------
xnoremap is :s/$/                              /g<CR>
" ビジュアルモードで選択中の範囲からスペースを除去
xnoremap ds :s/\%V *//<CR>
" 行末に/を入れる
xnoremap i/ :s/$/\//<CR>

" ----------------------------------------------------------------------------------------------------
" 全選択
" ----------------------------------------------------------------------------------------------------
" nnoremap <C-a> gg<S-v>G

" ----------------------------------------------------------------------------------------------------
" Ctrl+Enterで該当行をbashで実行
" ----------------------------------------------------------------------------------------------------
nnoremap <NL> <S-v>!bash
xnoremap <NL> !bash

" ----------------------------------------------------------------------------------------------------
" :s<Space>で %s///gを自動入力
" ----------------------------------------------------------------------------------------------------
cnoreabbrev <expr> s getcmdtype() .. getcmdline() ==# ':s' ? [getchar(), ''][1] .. "%s///g<Left><Left>" : 's'


" ====================================================================================================
" 保存関連
" ====================================================================================================
" スワップファイルを作成しない
set noswapfile

" ファイルを上書きする前にバックアップを作ることを無効化
set nowritebackup
set nobackup

" ====================================================================================================
" ヤンク関連
" ====================================================================================================
" yでコピーした時にクリップボードに入る
set guioptions+=a
" ヤンクでクリップボードにコピー
set clipboard=unnamed,autoselect

" ====================================================================================================
" 表示関連
" ====================================================================================================
" 行番号を表示
set number
" 現在の行を強調表示
set cursorline
" 現在の行を強調表示（縦）
" set cursorcolumn
" 行末の1文字先までカーソルを移動できるように
set virtualedit=onemore
" インデントはスマートインデント
set smartindent
" ビープ音を可視化
set visualbell
" 括弧入力時の対応する括弧を表示
set showmatch
" ステータスラインを常に表示
set laststatus=2
" コマンドラインの補完
set wildmode=list:longest
" カーソルの位置表示を行う
set ruler
autocmd Colorscheme * highlight FullWidthSpace ctermbg=white
" autocmd VimEnter * match FullWidthSpace /　/
" colorscheme deser

" ステータスバーに文字コード、改行コードを表示
set statusline=%<%f\ %m%r%h%w%{'['.(&fenc!=''?&fenc:&enc).']['.&ff.']'}%=%l,%c%V%8P
" 自動改行させない
set nowrap
" vim の矩形選択で文字が無くても右へ進める
set virtualedit+=block

" ====================================================================================================
" ウィンドウ関連
" ====================================================================================================
" nnoremap <C-k> <C-w>v
" nnoremap <C-j> <C-w>s

" ====================================================================================================
" タブバー関連
" ====================================================================================================
" タブバーを非表示
" set showtabline=0
" 2個以上のタブがあるときのみタブバーを表示する
" set showtabline=1
" タブバーを表示する（常時）
set showtabline=2

" ====================================================================================================
" タブ関連
" ====================================================================================================
" 不可視文字を可視化(タブが「^   」と表示される)
set list listchars=tab:»-,eol:↲
" Tab文字を半角スペースにする
set expandtab
" 行頭以外のTab文字の表示幅（スペースいくつ分）
set tabstop=4
" 行頭でのTab文字の表示幅
set shiftwidth=4

" ====================================================================================================
" 検索関連
" ====================================================================================================
" 検索文字列が小文字の場合は大文字小文字を区別なく検索する
set ignorecase
" 検索文字列に大文字が含まれている場合は区別して検索する
set smartcase
" 検索文字列入力時に順次対象文字列にヒットさせる
set incsearch
" 検索時に最後まで行ったら最初に戻る
set wrapscan
" 検索語をハイライト表示
set hlsearch
" ESC連打でハイライト解除
nmap <Esc><Esc> :nohlsearch<CR><Esc>

"対応する括弧に移動
" nnoremap [ %
" nnoremap ] %

" ====================================================================================================
" ターミナル関連
" ====================================================================================================
" 選択行をbashで実行
vnoremap <C-CR> :!bash<CR>
" 現在行をbashで実行
nnoremap <C-CR> V:!bash<CR>

" ====================================================================================================
" command関連
" ====================================================================================================
" どこを修正したのか確認
nnoremap diff :w !diff - %<CR>
nnoremap vimdiff :w !vimdiff - %<CR>

" ====================================================================================================
" テンプレート関連
" ====================================================================================================
autocmd BufNewFile *.sql 0r $HOME/.vim/template/plsql.sql
autocmd BufNewFile *.md 0r $HOME/.vim/template/markdown.md
autocmd BufNewFile *.uml 0r $HOME/.vim/template/plantuml.txt
autocmd BufNewFile *.sh 0r $HOME/.vim/template/shellscript.sh

" ====================================================================================================
" コマンドマップ
" ====================================================================================================
" ファイルのある場所にカレントディレクトリを移したい場合,:cd <C-X> で、ディレクトリが補完される.
" 参考
" https://mattn.kaoriya.net/software/vim/20071207013918.htm

" expand path
cmap <c-x> <c-r>=expand('%:p:h')<cr>/
" expand file (not ext)
cmap <c-z> <c-r>=expand('%:p:r')<cr>

" ====================================================================================================
" ウィンドウの開く方向を指定
" ====================================================================================================
" 新しいウィンドウを下に開く
set splitbelow
" 新しいウィンドウを右に開く
set splitright

" ====================================================================================================
" Visual mode の * に機能を割り当てる
" 参考：https://vim-jp.org/vim-users-jp/2009/11/25/Hack-104.html
" ====================================================================================================
vnoremap <silent> * "vy/\V<C-r>=substitute(escape(@v,'\/'),"\n",'\\n','g')<CR><CR>

